# CoverOffset Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricSheet..::..CoverOffset Property
FabricSheet Class See Also
---
The additional cover offset of the Fabric Sheet.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double CoverOffset { get; set; }
```

Visual Basic
---
```text
Public Property CoverOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CoverOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for coverOffset is not a number -or- When setting this property: coverOffset is greater then the host thickness. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for coverOffset must be between 0 and 30000 feet. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: |

# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace